import random
when = ['Μια φορά και έναν καιρό', 'Ένα κρύο και χειμωνιάτικο βράδυ', 'Κάποτε', 'Μια μέρα ανοιξιάτικη', 'Την εποχή εκείνη', 'Τον καιρό εκείνο', 'Μια ζεστή και γεμάτη αστέρια καλοκαιρινή βραδιά', 'Μια φορά και έναν καιρό, πριν από πολλά χρόνια']
where = ['στο Τέξας', 'στο Μεξικό', 'στο μαγικό βουνό', 'στο στοιχειωμένο πλοίο', 'στο σπίτι της κακιάς μάγισσας', 'σε ένα κρύο, σκοτεινό και αφιλόξενο δάσος', 'στο ζαχαρένιο κάστρο','στο δρόμο που δεν οδηγούσε πουθενά', 'στα καταγάλανα νερά του πελάγους', 'στον μαγεμένο κήπο με τις τριανταφυλλιές']
happened = ['εμφανίστηκε', 'υπήρχε', 'πήγε', 'βρέθηκε', 'ταξίδευε']

# Στο "who" να γίνει διαχωρισμός αρσενικού με θυληκό με περισσότερες επιλογές #

who = ['ένας σκύλος', 'ένας λαγός', 'ένας ελέφαντας', 'ο καλόκαρδος γίγαντας','ο σκοτεινός ιππότης', 'ο πειρατής με το ξύλινο πόδι', 'ο μπισκοτένειος άνθρωπος', 'ένα πολύχρομο ψάρι', 'ένας ομιλούμενος βάτραχος', 'ο άτακτος καλικάτζαρος', 'μια χελώνα','η μικρή Νεφέλη','η μικρή νεράιδα']
which = ['ήθελε να γυρίσει όλο τον κόσμο', 'δεν είχε καθόλου φίλους', 'φοβόταν το σκοτάδι', 'ήθελε να μάθει να πετάει', 'κολυμπούσε πολύ καλά']
with1 = ['ενα πλοίο', 'ένα αεροπλάνο', 'ένα αερόστατο', 'ένα αυτοκίνητο', 'ένα ποδήλατο', 'ένα πατίνι']
what = ['φόρτωσε', 'είδε', 'βούτηξε', 'έκλεψε', 'πήρε']
quantity = ['ένα','δυό', 'τρία', 'τέσσερα', 'πέντε', 'έξι', 'εφτά', 'οχτώ', 'εννιά', 'δέκα']
style = ['μικρά και χαριτωμένα', 'όμορφα', 'καλόκαρδα', 'κακιασμένα', 'φοβερά και τρομερά']
items = ['μήλα', 'πορτοκάλια', 'αχλάδια', 'καρπούζια', 'παιδιά', 'κορίτσια', 'κουνελάκια']
verbs = ['τα πήγε', 'τα ήθελε', 'τα έδεσε', 'τα μαγείρεψε', 'τα έφαγε', 'τα έλιωσε', 'τα πέταξε']
place = ['σε ένα υγρό και σκοτεινό σπήλαιο', 'στον πάτο της θάλασσας', 'στο βουνό του χαμού', 'στο ιπτάμενο πλοίο', 'στο κλειδωμένο αμπάρι του θαλασσοδαρμένου πλοίου']
name = ['Ιπτάμενος Ολλανδός', 'Φαντασία', 'Μαύρο Μαργαριτάρι', 'Τιτανικός','Βρετανικός', 'Μαυρογέννης', 'Το Εληξήριο του Βρυκόλακα', 'Μαύρη Χήρα', 'Δάκρυα των Αγγέλων', 'Μαύρος Κουρσάρος']

connect_1 = ['Εκεί όμως που', 'Στη διαδρομή ενώ', 'Ενώ', 'Καθώς όμως']
verbs_2 = ['βρισκόταν', 'πήγαινε', 'έτρωγε', 'ταξίδευε', 'πέταγε']
verbs_3 = ['είδε', 'βρήκε', 'πέτυχε','συνάντησε', 'έπεσε πάνω σε']

## quantity_2 = [el for el in quantity_2 if el != n]

quantity_2 = ['δυό', 'τρία', 'τέσσερα', 'πέντε', 'έξι', 'εφτά', 'οχτώ', 'εννιά', 'δέκα']
person = ['παιδάκια', 'αγόρια', 'κόρίτσια', 'κουνελάκια', 'νάνους', 'γίγαντες', 'πολύχρωμα πουλιά', 'ιπτάμενα ψάρια']

print(random.choice(when) + ' ' + random.choice(where) + ', ' + random.choice(happened) + ' ' + random.choice(who) + ' ' + "που" + ' ' + random.choice(which) + ' ' + "με" + ' ' + random.choice(with1) + ', ' + "και" + ' ' + random.choice(what) + ' ' + random.choice(quantity) + ' ' + random.choice(style) + ' ' + random.choice(items) + ' ' + "τα οποία" + ' ' + random.choice(verbs) + ' ' + random.choice(place) + ' ' + "που λεγόταν" + ' ' + random.choice(name))
print()
print(random.choice(connect_1) + ' ' + random.choice(verbs_2) + ' με ' + random.choice(with1) + ' ' + random.choice(verbs_3) + ' ' + random.choice(quantity_2) + ' ' + random.choice(person) + ' ' + "που" + ' ' + random.choice(verbs) + ', ' 'ενώ' + ' ' + random.choice(verbs_2) + ' ' + random.choice(where))



